Repository: tryswift/try-swift-tokyo
Catalog: MyLibrary/Sources/ScheduleFeature/Localizable.xcstrings
Source language: en
Languages: ja

source: Leverage hand tracking in Apple Vision Pro to build a SwiftUI window that operates like the native visionOS SystemOverlay. Invoke and manipulate windows intuitively in 3D space, creating a touch-like UI. We present a new interface for spatial computing.
ja: Apple Vision Pro のハンドトラッキング機能を活用して、ネイティブの visionOS SystemOverlay のように動作する SwiftUI ウィンドウを構築します。 3D空間で直感的にウィンドウを呼び出し、操作することで、タッチ操作に近いユーザーインターフェースを実現します。 これにより、空間コンピューティング向けの全く新しいインターフェースを提案します。

source: Live coding a streaming ChatGPT proxy with Swift OpenAPI—from scratch!
ja: Swift OpenAPIを使ったライブコーディング ― ゼロから構築するストリーミングChatGPTプロキシ

source: Localizing your app into other languages can unlock a huge amount of growth potential for your app. But as an indie developer, I don’t have time to spare and don’t have others I can rely on to do the work involved in maintaining a high quality localization. So, I rely heavily on automation to minimize the work associated with maintaining 8 different high-quality localizations in my app Nihongo. In this talk, I’ll discuss what aspects of localization I entrust to professional translators, what I use machine translation for, and what I use crowdsourcing from social media for. I’ll discuss techniques for automating various aspects of the localization process, including (1) generating screenshots of strings for providing context to translators and validating their translations, (2) generating app store screenshots, including marketing copy in multiple languages, (3) generating meaningful release notes in multiple languages, and (4) verifying app layout and correctness in multiple languages.
ja: 他言語へのアプリローカライゼーションは、アプリの成長潜在力を大きく解放することができます。しかし、インディーデベロッパーとして、時間に余裕がなく、高品質なローカライゼーションを維持するための作業を他人に任せることもできません。そのため、私は自分のアプリ「Nihongo」で8種類の高品質ローカライゼーションを維持する作業を最小限に抑えるために、自動化に大きく依存しています。 このトークでは、ローカライゼーションのどの側面をプロの翻訳者に委ね、どの側面を機械翻訳に使用し、どの側面をソーシャルメディアからのクラウドソーシングに使用するかについて話します。翻訳者へのコンテキスト提供とその翻訳の検証のための文字列のスクリーンショット生成、複数言語のマーケティングコピーを含むアプリストアスクリーンショットの生成、複数言語での意味のあるリリースノートの生成、および複数言語でのアプリレイアウトと正確性の検証など、ローカライゼーションプロセスの様々な側面を自動化する技術について議論します。

source: Lunch
ja: 昼食

source: Lux Optics builds popular, award-winning photography and video apps, such as Halide, Kino, and Spectre. Let's dive into engineering principles that guide development, such as short feedback loops, avoiding technical sink-holes, and approach problems from a scientific perspective.
ja: Lux Opticsは、Halide、Kino、Spectreなどの人気かつ受賞歴のある写真・動画アプリを開発しています。 このトークでは、短いフィードバックループの確立、技術的な落とし穴の回避、そして科学的視点から問題に取り組むといった、開発を支えるエンジニアリング原則について探求します。

source: Macro testing
ja: マクロをテストする

source: Macros are little compiler plugins that allow us to extend the Swift language in ways that do not require going through Swift evolution, or waiting for a Swift core team member to implement the feature, or require us learning C++ so that we can try implementing the feature ourselves. It is an incredibly powerful new feature, but can also be incredibly complex to get right. Let's explore how to debug and test every aspect of macros, from the code they expand to, to the errors and warnings and fix-its they emit.
ja: マクロは、Swiftの進化を経ず、Swiftコアチームのメンバーが機能を実装するのを待たず、または自分で機能を実装するためにC++を学ぶ必要がないように、Swift言語を拡張することを可能にする小さなコンパイラプラグインです。これは非常に強力な新機能ですが、正しく行うには非常に複雑になることもあります。マクロが展開するコード、発生するエラーや警告、修正提案など、マクロのすべての側面をデバッグしてテストする方法を探りましょう。

source: Marcin is a developer with extensive experience. He currently works at Judo.app, where he is building an interface builder for SwiftUI. Marcin has published numerous iOS/macOS libraries and tools, including CryptoSwift, ObjectivePGP, and the Online Swift Playground, which allows for interactive Swift code execution from a web browser. He is currently on a mission to ship SwiftStudio.app, an independent third-party IDE for Swift.
ja: Marcinは豊富な経験を持つ開発者である。彼は現在Judo.appで働いており、SwiftUIのインターフェースビルダーを構築している。Marcinは、CryptoSwift、ObjectivePGP、WebブラウザからインタラクティブなSwiftコードの実行を可能にするOnline Swift Playgroundなど、数多くのiOS/macOSライブラリやツールを公開している。彼は現在、Swift用の独立したサードパーティIDEであるSwiftStudio.appを出荷する使命を帯びている。

source: Migrating Large Codebases Without Breaking The World
ja: 平和に大規模なコードベースを移行する方法

source: Mikaela Caron is an independent iOS Engineer who actively shares her expertise on social media, focusing on iOS development, building apps in public, and freelancing. She’s continuing to work on her indie app Fruitful, which helps people connect with others at conferences, while also traveling as much as she can. She’s also an organizer for iOSDevHappyHour and loves giving back to the community.
ja: Mikaela Caronは、iOS開発、アプリの公開開発、フリーランスに関する知識をSNSで積極的に発信している独立系iOSエンジニアです。現在は、カンファレンスでの交流をサポートするインディーアプリ『Fruitful』の開発を続けながら、できる限り多くの場所を旅しています。また、iOSDevHappyHourのオーガナイザーを務めるなど、コミュニティへの貢献も大切にしています。

source: Most people know my dad, Paul, but I've been building apps with SwiftUI for three years now and want to share what I've learned. I like manga, go karting, and coding, but I spend most of my time looking after my dogs.
ja: 多くの人は私の父、Paulを知っていると思いますが、私はSwiftUIを使ったアプリ開発を3年間続けていて、学んだことを皆さんと共有したいと思っています。漫画やゴーカート、コーディングが好きですが、ほとんどの時間は愛犬のお世話をしています。

source: Nick is a veteran developer, author and open source aficionado, and has been developing iOS apps since the dark ages of manual memory management back in 2009. He is known for various open source projects such as SwiftFormat, Euclid, Expression and iCarousel. When Nick isn't writing parsers in (and for) Swift, he likes to tinker with 3D graphics and even sometimes fancies himself as a games developer.
ja: NickはiOSアプリ開発に2009年のメモリ管理が手動だった時代から携わるベテラン開発者であり、著者でもあります。SwiftFormat、Euclid、Expression、iCarouselといったオープンソースプロジェクトで知られています。Swiftでパーサーを書いていないときには、3Dグラフィックスに取り組んだり、ゲーム開発者気分を楽しんだりしています。

source: Noah is a software engineer from Los Angeles. He co-founded Emerge Tools in 2020 after spending 5 years working on Airbnb's iOS app and backend. He's passionate about mobile developer tools that reduce the complexity of apps and make them faster. Outside of building dev tools, he researches systems for machine learning as a PhD student. When he's not staring at a screen, Noah can be found in the water perfecting his strokes or on the trail working through a list of mountain peaks.
ja: Noahはロサンゼルス出身のソフトウェアエンジニアです。AirbnbでiOSアプリとバックエンドの開発に5年間携わった後、2020年にEmerge Toolsを共同設立しました。モバイルアプリの複雑さを軽減し、高速化する開発ツールに情熱を注いでいます。開発ツール作り以外では、機械学習システムの研究に取り組む博士課程の学生でもあります。画面に向かっていないときは、水中で泳ぎの技術を磨いたり、山頂リストを達成するためにトレイルを歩いたりしていることが多いです。

# Office hour %@
source: Office hour with %1$@
ja: Q&A

# Office hour description %@
source: Meet %1$@ and ask questions about the talk. This is a great opportunity to get more insights and learn more about the topic.
ja: %1$@さんに会って、トークについて質問しましょう。これは、さらに洞察を得て、トピックについてより深く学ぶ絶好の機会です。

source: Opening
ja: オープニング

source: Osama is an iOS engineer at Classmethod in Japan, and He’s also a breakdancer who came in second place at the World Breakdancing Championship in Germany in 2007. In the world, He often go by the name ‘Lil Ossa’. He has a passion for both beer and dance, as well as creating iOS apps. He loves sharing his unique iOS development experiences at conferences, including Swiftable 2023 and iOSDC Japan 2022.
ja: 日本のクラスメソッドに所属するiOSエンジニアであり、2007年にドイツで開催されたブレイクダンス世界選手権で2位となったブレイクダンサーでもある。世界では「リル・オッサ」の名で呼ばれることが多い。ビールとダンス、そしてiOSアプリの開発に情熱を注ぐ。Swiftable 2023やiOSDC Japan 2022などのカンファレンスで、自身のユニークなiOS開発経験を共有するのが大好き。

source: Paul is the author of Hacking with Swift, Pro Swift, Swift Design Patterns, Testing Swift, Swift Coding Challenges, and more. Suffice it to say, he quite likes Swift. And coffee. (But mostly Swift.) (And coffee.)
ja: Paulは『Hacking with Swift』、『Pro Swift』、『Swift Design Patterns』、『Testing Swift』、『Swift Coding Challenges』などの著者です。言うまでもなく、彼はSwiftとコーヒーが大好きです。

source: Paul is the author of Hacking with Swift, Pro Swift, Swift Design Patterns, Testing Swift, Swift Interview Challenges, and more. Suffice it to say, he quite likes Swift. And coffee. (But mostly Swift.) (And coffee.)
ja: Paulは「Hacking with Swift」「Pro Swift」「Swift Design Patterns」「Testing Swift」「Swift Interview Challenges」などの著者です。簡単に言うと、Swiftが大好きです。そしてコーヒーも。（でも主にSwiftが。）（いや、コーヒーも同じくらい。）

source: Peer Labs is your chance to get hands on with things you learned from try! Swift presentations, discuss any issues with the speakers, connect with your peers, work on open source projects, organize impromptu learning sessions and more! Peer labs do not have a strict structure, and are open-ended instead. It is what you and your peers make of it! We will ask everyone to introduce themselves in the beginning, and then it is up to you to ask questions and work together with others on projects that interest you.
ja: もくもく会は、あなたがtry.Swiftのプレゼンテーションで学んだことを実践するチャンスです！Swiftのプレゼンテーション、スピーカーとのディスカッション、仲間との交流、オープンソースプロジェクト、即席の学習セッションなどなど！もくもく会には厳密な構成はなく、色々なことができます。みなさんで作るものです！はじめに全員に自己紹介をしてもらい、その後、質問をしたり、興味のあるプロジェクトに一緒に取り組んだりするのはあなた次第です。

source: Please enjoy the meal and have a chat with other attendees.
ja: お弁当を楽しんだり、他の参加者とおしゃべりしましょう。

source: Prioritizing Health: Developing a Personalized App
ja: 健康第一！自分専用の個人アプリ開発

source: Raymarching Shaders with SwiftUI
ja: SwiftUIでレイマーチングシェーダー

source: Registration
ja: 受付

source: Rendering beautiful text using MSDFs and Metal.
ja: MSDFとMetalを用いた美しいテキストレンダリング

source: Requirements
ja: 必要なもの

source: Ryota Motonishi is an iOS engineer at LY Corporation. He is working on the development of the LINE chat app. In his free time, he enjoys singing karaoke.
ja: Ryota Motonishiは、LY CorporationのiOSエンジニアです。現在、LINEチャットアプリの開発に携わっています。余暇にはカラオケを楽しんでいます。

source: S_Shimotori is an iOS application engineer. After work, I prepare for conferences, and on my days off, I enjoy playing games and eating out.
ja: iOSアプリエンジニアです。終業後はカンファレンスの準備を、休日はゲームと食べ歩きをしています。

source: Saleem is currently a Software Engineer at The Browser Company and a member of the Swift core team. He has worked at Google, Facebook, and Microsoft in the past. His interests lie in systems, and has worked on compilers and programming languages for over a decade, with some embedded systems thrown in. While currently focused on cross-platform Swift, primarily on Windows, he has ported Swift to Android and Windows amongst other environments.
ja: Saleemは現在、The Browser Companyのソフトウェアエンジニアで、Swiftコアチームのメンバーです。過去にはGoogle、Facebook、Microsoftで働いていた経験があります。彼の興味はシステムにあり、10年以上コンパイラとプログラミング言語に携わり、組み込みシステムにも携わってきました。現在は、主にWindows上のクロスプラットフォームSwiftに注力していますが、SwiftをAndroidやWindowsに移植した経験もあります。

source: Satoshi is a software engineer living in Tokyo, Japan. He works for CyberAgent in a photography studio that enables virtual production. He is also working on "the visionOS 30 Days Development Challenge" and a virtual camera implementation, and uploading the results to GitHub. He loves ARKit and has recently pursued visionOS development and looks forward to a society where Vision Pro is widely used.
ja: 東京在住のソフトウェアエンジニアです。 サイバーエージェントに所属しており、バーチャルプロダクションを実現する撮影スタジオで働いています。 visionOS 30 Days 開発チャレンジや仮想カメラ実装などGitHubにアップしています。 ARKitが大好きで、最近はvisionOSの開発を追求中です。 Vision Proが普及した社会が楽しみですね。

source: Schedule
ja: スケジュール

source: Searching for Aliens
ja: 宇宙人を探して

source: Sebastiaan is an ex-Apple designer now making camera apps like Halide, Kino and Spectre at Lux
ja: Sebastiaanは元Appleのデザイナーで、現在はLuxでHalide、Kino、Spectreといったカメラアプリを開発しています。

source: SF Symbols 5 offers 5,000+ symbols, simplifying icon creation. But we often overlook many SF Symbols. Join us on a journey fusing SwiftUI, SF Symbols, and Art. Unlock tips to use SF Symbols creatively. Discover the SF Symbols mastery even Apple didn't foresee. Explore unique symbols with us.
ja: SF Symbols 5には5,000以上のシンボルがあり、アイコン作成が簡単になりました。しかし、多くのSF Symbolsが見落とされています。 SwiftUI、SF Symbols、そしてアートを融合させた旅にご参加ください。SF Symbolsを創造的に使うためのヒントをお伝えします。Appleも予想しなかったSF Symbolsの使い方を発見しましょう。一緒にユニークなシンボルを探索しましょう。

source: Shinichiro is a software engineer and works on improvements of DevOps and DevEx in various teams. He also contributes some open-sourced swift projects.
ja: レゴとSwiftが好きなプログラマ。iOSエンジニアとしてフリマアプリ「メルカリ」の立ち上げに参画し、現在は独立してプログラミング教育分野で活動中。iOSアプリ「Boost Remote」「Scrub」の作者。著書に『入門LEGO MINDSTORMS NXT 第2版 レゴブロックで作る動くロボット』(毎日コミュニケーションズ)など。

source: Si works at Apple, where he helps maintain a number of open-source Swift libraries to support server-side use cases. Before that, he’s worked in a wide range of areas including virtulalization, cloud technologies, privacy-preserving machine learning, and developer tools. Si is based in Cambridge, UK, but loves to travel and see new places. He’s hugely passionate about coffee and enjoys playing bass guitar.
ja: SiはAppleで働いており、サーバーサイドでの利用を支援するために、複数のオープンソースのSwiftライブラリの維持に携わっています。以前は、仮想化、クラウド技術、プライバシー保護機械学習、開発者向けツールなど、幅広い分野での経験を積んできました。 現在はイギリスのケンブリッジを拠点に活動していますが、旅行をして新しい場所を訪れるのが大好きです。コーヒーには強い情熱を持っており、ベースギターを弾くのも楽しんでいます。

source: Sign in with Luma and show QR code of your ticket at the reception.
ja: LumaにログインしてQRコードを掲示してください。

source: Skip is an innovative tool that transforms Swift code for Android with native performance. Evolving from transpiling Swift to Kotlin, it now runs compiled native Swift on Android. In 5 minutes, discover Skip's fundamentals, architecture, and its advantages over React Native and Flutter!
ja: Skipは、SwiftコードをAndroid向けに変換し、ネイティブパフォーマンスを実現する革新的なツールです。 元々はSwiftからKotlinへのトランスパイルとして進化してきましたが、現在はAndroid上でコンパイルされたネイティブSwiftを実行します。 5分間のセッションで、Skipの基本原理、アーキテクチャ、そしてReact NativeやFlutterに対する優位性についてご紹介します。

source: Software Engineer at DeNA Inc., specializing in mobile development for live streaming applications. With extensive experience in iOS development since the Objective-C era, I am passionate about leveraging Swift’s evolution to create innovative and efficient applications.
ja: 株式会社ディー・エヌ・エーのソフトウェアエンジニアとして、ライブストリーミングアプリのモバイル開発を担当しています。 Objective-Cの時代からiOS開発に長年携わり、Swiftの進化を活かして革新的で効率的なアプリ開発に情熱を注いでいます。

source: Software Engineer at newmo, Inc.
ja: newmo, Inc.のソフトウェアエンジニア

source: Software superstar. Stuttering stud. Lead maintainer of fastlane tools.
ja: ソフトウェア界のスーパースター。fastlaneツールのリード・メンテナー

source: Sometimes Swift developers make fun of languages such as JavaScript that have vague concepts like "truthy" and "falsy", but Swift is packed with its own surprises and has plenty sharp edges of its own. In this talk I want to show some of the surprising behaviors of Swift – things that behave weirdly, traps you can easily fall into, and fixes to help you write better code. There will be lots of hands-on code samples everyone can try, and it will be a fun journey through the quirks of a language we all think we know.
ja: Swift開発者の中には、JavaScriptの「truthy」や「falsy」といった曖昧な概念を冗談交じりに笑う人もいますが、実はSwiftにも独自の驚きが満載で、予想外の鋭い側面が存在します。 このトークでは、Swiftの驚くべき挙動―奇妙な動作、簡単に陥ってしまう落とし穴、そしてより良いコードを書くための修正策―を紹介します。多数のハンズオンコードサンプルを用意しており、参加者全員が実際に試しながら、普段は馴染みのあるはずのこの言語の意外な一面を楽しく探求する旅に出かけましょう。

source: Special effects with SwiftUI Text
ja: SwiftUI Textを使った特殊効果

source: Stephen entered tech by way of a liberal arts degree. He now works on Point-Free with Brandon Williams, where he tries to spread the word of testable, composable app development.
ja: Stephenは、リベラルアーツの学位から技術者の道に進みました。現在はBrandon WilliamsとともにPoint-Freeに携わり、テスト可能でコンポーザブルなアプリ開発の普及に努めています。

source: Swift boasts a powerful language feature known as type inference, which is crucial for balancing a safe type system with ease of coding. Understanding how this essential feature is implemented can aid in writing better code. In this talk, I will explain the workings of Swift's type inference, including the fundamental algorithm that allows bidirectional propagation of type information for code, and how it's extended to accommodate language features like overloading. This will help understand why compiling code can become overly burdensome and result in errors. I will also cover interesting related topics such as overload priority, simultaneous inference in multiple statements, and the challenges of protocol compliance determination. Additionally, methods for directly observing the behavior of type inference using compiler options will be introduced, paving the way for further deepening your understanding.
ja: Swiftには型推論という素晴らしい言語機能があります。これは安全な型システムとコードの書きやすさを両立させるために重要です。 そのような重要な機能がどのように実現されているのか理解することは、良いコードを書くことに役立つでしょう。 そこでこの発表では、Swiftの型推論の動作について解説します。 型推論の基本となる、コードに対して双方向から型情報の伝搬を可能にするアルゴリズムを説明し、さらにオーバーロードなどの言語機能に対応するための拡張方法に触れます。これにより、コードのコンパイルが重すぎてエラーが出てしまう理由がわかるでしょう。 オーバーロード優先度、複数文の同時推論、プロトコル準拠判定の難しさなど、関連する興味深いトピックも紹介します。 また、コンパイラオプションを利用して、型推論の動作を直接観察する方法を紹介します。この先も更に理解を深めていくことができるようになるでしょう。

source: Swift is a fantastic general purpose language, which can and has been successfully used beyond its mobile origins, from embedded through server-side systems. One of Swift's unique strengths is its powerful native language interoperability with C and C++. Recently, the Swift project started work on integrating improved Swift/Java interoperability with the use of both JNI and the new Foreign Function and Memory APIs introduced in JDK22. In this talk we'll deep dive into the deep integration approach taken between the language runtimes using the FMM APIs and their unique strengths but also challenges.
ja: Swiftは、モバイル発祥に留まらず、組み込みシステムからサーバーサイドに至るまで幅広く活用される素晴らしい汎用言語です。 その独自の強みのひとつとして、CやC++との強力なネイティブな言語相互運用性が挙げられます。 最近、Swiftプロジェクトでは、JNIとJDK22で導入された新しいForeign Function and Memory APIsを活用し、SwiftとJava間の相互運用性の向上に取り組み始めました。 このトークでは、FMM APIを利用した言語ランタイム間の深い統合アプローチに迫り、そのユニークな強みと同時に直面する課題について詳しく解説します。

source: Swift is cool but... do you know what's cooler? Successfully code signing your Swift apps. Code signing issues can certainly be scary but they can be really fun to solve! This talk will teach you how to take a step back from scary code signing errors to calmly and quickly code sign your apps.
ja: Swiftはかっこいいですけど、もっとかっこいいのは何だと思いますか？それは、Swiftアプリをコード署名できることです。コード署名の問題って本当に頭が痛いものですが、解決する過程は意外と楽しいんですよ！この話では、コード署名のエラーに怖がらず、冷静にそして素早くアプリをコード署名する方法をお教えします。

source: Swift Programming in Japanese
ja: 日本語でのSwiftプログラミング

source: Swift WTF: Weirdness, traps, and fixes
ja: Swift WTF: 奇妙な挙動、落とし穴、そして修正策

source: Swift's regex engine is an ambitious project aiming to be a superset that encompasses all existing regular expressions. However, as of now, many features, such as lookbehind, remain unimplemented. Contributing to this project can be challenging due to the complexity of the existing codebase. In this talk, we will implement a small regex engine in Swift, focusing on the three fundamental operations: concatenation, alternation, and repetition. We will also explore how to implement a backtracking (VM-based) approach similar to Swift's official regex engine. By understanding this implementation, you'll take the first step toward deciphering Swift's official regex engine and contributing to its development.
ja: Swiftの正規表現は、既存のあらゆる正規表現を包含するスーパーセットを目指す壮大なプロジェクトです。 しかし、現時点では「後読み」など未実装の機能も多く存在します。そこで自分でプロジェクトに貢献しようと思っても既存のコードベースの理解は容易ではありません。 本講演では、「連接」「選択」「繰り返し」の基本三演算に限定した小さな正規表現エンジンをSwiftで実装し、Swiftの正規表現エンジンと同様のバックトラック方式（VM型）の実装方法を解説します。 これにより公式の実装を読み解いたり、機能の拡張へ貢献するための第一歩を踏み出せるようになります。

source: SwiftSyntax is Apple's library for parsing and manipulating Swift code. It can be use for anything from formatting source code (as in swift-format) to generating it (as in Swift Macros). In this talk I'll explain how the SwiftSyntax library works - the range and limitations of its capabilities, and demonstrate some cool use cases that you might not have considered.
ja: SwiftSyntaxは、Swiftコードの解析や操作を行うためのApple純正ライブラリです。 このライブラリは、ソースコードのフォーマット（swift-formatの場合）から、コード生成（Swift Macrosの場合）に至るまで、幅広い用途で活用できます。 本セッションでは、SwiftSyntaxライブラリの動作原理、その機能範囲や制約について解説し、思いもよらなかったクールな活用事例をいくつかご紹介します。

source: SwiftSyntax: for good and evil
ja: SwiftSyntax: evalの力、善にも悪にも

source: SwiftUI API Design Lessons: Bridging Procedural APIs with the Declarative World
ja: SwiftUI APIデザインの教訓: 手続き型APIと宣言型世界の橋渡し

source: SwiftUI APIs are inherently declarative, yet many existing Apple platform APIs are designed to be used in a procedural manner. In this session, we'll explore how to design and implement SwiftUI-friendly declarative APIs that integrate with procedural frameworks. Using AVFoundation as an example, we will build a photo and video capture app while uncovering best practices for adapting procedural APIs to the declarative paradigm of SwiftUI.
ja: SwiftUIのAPIは本質的に宣言型ですが、多くの既存のAppleプラットフォームAPIは手続き型として設計されています。 本セッションでは、手続き型フレームワークと統合可能なSwiftUIフレンドリーな宣言型APIをどのように設計・実装するかを探求します。 例としてAVFoundationを用い、写真・ビデオキャプチャアプリを構築しながら、手続き型APIをSwiftUIの宣言型パラダイムに適応させるためのベストプラクティスを明らかにしていきます。

source: SwiftUI's syntax is great for UI, but it can also be used for 3D graphics. We'll combine SwiftUI's elegant syntax with raymarching and signed distance functions to make cool shaders.
ja: SwiftUIの文法は主にUI作成に優れていますが、実は3Dグラフィックスにも応用可能です。 このセッションでは、SwiftUIの洗練されたシンタックスとレイマーチング、さらにはSigned Distance Functionsを組み合わせることで、クールなシェーダーを作成する方法を探求します。

source: Take a break and meet other attendees or sponsors
ja: 休憩して他の参加者やスポンサーと交流しましょう

source: Take a group photo with all attendees and speakers
ja: 参加者全員と講演者と一緒に集合写真を撮ります

source: Take a lunch box and meet other attendees or sponsors.
ja: お弁当を持って、他の参加者やスポンサーと交流しましょう。

source: Take your iOS app to the next level by integrating 3D content with SwiftUI. Go beyond static models and learn how to add animations, dynamic content ,performance enhancements and interactive elements using RealityKit, creating immersive experiences that set your app apart.
ja: SwiftUIと連携して3Dコンテンツを取り入れることで、あなたのiOSアプリを次のレベルへと引き上げましょう。 静的なモデルに留まらず、RealityKitを活用してアニメーション、動的コンテンツ、パフォーマンス向上、そしてインタラクティブな要素を加えることで、他にはない没入型体験を実現する方法を学びます。

source: Ten Principles of Lux Development
ja: Lux開発の10原則

source: The Drake Equation, used by astrophysicists to estimate the number of alien civilizations we can communicate with, has many unexpected lessons for our work of building apps. A takeaway from this equation is the huge number of stars in the universe, which implies a high probability that some of them harbor life. This talk will dive into the details of the equation and then apply it to iOS. Just as the number of stars provide a powerful scale factor, there are technical factors of your app that can multiply your impact. We'll derive a new equation to calculate the carbon footprint of an app, look at iOS memory management to speed up every CPU instruction, and calculate how to reduce bugs all using lessons from the Drake Equation. I will also discuss my own experience building a startup and how I think about the implications of these scale factors when designing developer tools that many large apps will use.
ja: 天体物理学者が我々と通信可能なエイリアン文明の数を推定するために用いるドレイク方程式は、アプリ開発においても予想外の教訓を提供してくれます。 この方程式が示す一つのポイントは、宇宙に存在する膨大な数の星々が、いずれかに生命を宿している可能性を示唆していることです。 このトークでは、まず方程式の詳細に踏み込み、その後iOSへの応用方法について解説します。 星の数が強力なスケールファクターを提供するのと同様に、あなたのアプリにも影響力を増幅させる技術的要因が存在します。 ドレイク方程式の教訓を応用して、アプリのカーボンフットプリントを計算する新たな方程式を導出し、iOSのメモリ管理を見直すことでCPU命令の実行速度を向上させ、さらにはバグを削減する方法についても検討します。 さらに、私自身のスタートアップ構築の経験を踏まえ、多くの大規模アプリが利用する開発者向けツールを設計する際に、これらのスケール要因が持つ意味についてもお話しします。

source: The Fascinating World of Addition in Swift
ja: なぜSwiftで「1 + 1 = 2」になるのか

source: The Future of C++ Interoperability: Insights from Porting a Game to Swift
ja: ゲームのSwift移植から見えたC++ interoperabilityの展望
